app/controllers/hubs_controller.rb

SELECT  "hubs".* FROM "hubs" WHERE "hubs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @hub = Hub.find(params[:id])

INSERT INTO "hubs" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @hub = Hub.new(hub_params)
    if @hub.save