app/controllers/sessions_controller.rb

SELECT  "hubs".* FROM "hubs" WHERE "hubs"."id" = ? LIMIT 1  [["id", 3]]
---
  def create
    hub = Hub.find_by(id: params[:session][:id].downcase)